#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apollo_TaskForce_Sand_Bag_02

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Apollo_TaskForce_Sand_Bag_02.Apollo_TaskForce_Sand_Bag_02_C
// 0x0020 (0x0BC0 - 0x0BA0)
class AApollo_TaskForce_Sand_Bag_02_C final : public ABuildingProp
{
public:
	class UStaticMeshComponent*                   S_TaskForce_Sand_Bag_06;                           // 0x0BA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_TaskForce_Sand_Bag_05;                           // 0x0BA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_TaskForce_Sand_Bag_04;                           // 0x0BB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_TaskForce_Sand_Bag_03;                           // 0x0BB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Apollo_TaskForce_Sand_Bag_02_C">();
	}
	static class AApollo_TaskForce_Sand_Bag_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AApollo_TaskForce_Sand_Bag_02_C>();
	}
};
static_assert(alignof(AApollo_TaskForce_Sand_Bag_02_C) == 0x000008, "Wrong alignment on AApollo_TaskForce_Sand_Bag_02_C");
static_assert(sizeof(AApollo_TaskForce_Sand_Bag_02_C) == 0x000BC0, "Wrong size on AApollo_TaskForce_Sand_Bag_02_C");
static_assert(offsetof(AApollo_TaskForce_Sand_Bag_02_C, S_TaskForce_Sand_Bag_06) == 0x000BA0, "Member 'AApollo_TaskForce_Sand_Bag_02_C::S_TaskForce_Sand_Bag_06' has a wrong offset!");
static_assert(offsetof(AApollo_TaskForce_Sand_Bag_02_C, S_TaskForce_Sand_Bag_05) == 0x000BA8, "Member 'AApollo_TaskForce_Sand_Bag_02_C::S_TaskForce_Sand_Bag_05' has a wrong offset!");
static_assert(offsetof(AApollo_TaskForce_Sand_Bag_02_C, S_TaskForce_Sand_Bag_04) == 0x000BB0, "Member 'AApollo_TaskForce_Sand_Bag_02_C::S_TaskForce_Sand_Bag_04' has a wrong offset!");
static_assert(offsetof(AApollo_TaskForce_Sand_Bag_02_C, S_TaskForce_Sand_Bag_03) == 0x000BB8, "Member 'AApollo_TaskForce_Sand_Bag_02_C::S_TaskForce_Sand_Bag_03' has a wrong offset!");

}

