#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_Living_Television_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Prop_Living_Television_01.Athena_Prop_Living_Television_01_C
// 0x0070 (0x0C10 - 0x0BA0)
class AAthena_Prop_Living_Television_01_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x0BA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AudioLoc;                                          // 0x0BB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Spawn_Location;                                    // 0x0BB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bKillSound;                                        // 0x0BC0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F37[0x7];                                     // 0x0BC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MID_Screen;                                        // 0x0BC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             StaticSound;                                       // 0x0BD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             StaticLayerWarningSound;                           // 0x0BD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StaticLayerCheckTime;                              // 0x0BE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F38[0x4];                                     // 0x0BE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        StaticLayerComp;                                   // 0x0BE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             StaticLayerMSound;                                 // 0x0BF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WarningLayerSpawnTime;                             // 0x0BF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F39[0x4];                                     // 0x0BFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        WarningLayerComp;                                  // 0x0C00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        StaticComp;                                        // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Athena_Prop_Living_Television_01(int32 EntryPoint);
	void Check_to_Spawn_Static_Layer();
	void ReceiveBeginPlay();
	void Check_to_Spawn_Warning_Layer();
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Prop_Living_Television_01_C">();
	}
	static class AAthena_Prop_Living_Television_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Prop_Living_Television_01_C>();
	}
};
static_assert(alignof(AAthena_Prop_Living_Television_01_C) == 0x000008, "Wrong alignment on AAthena_Prop_Living_Television_01_C");
static_assert(sizeof(AAthena_Prop_Living_Television_01_C) == 0x000C10, "Wrong size on AAthena_Prop_Living_Television_01_C");
static_assert(offsetof(AAthena_Prop_Living_Television_01_C, UberGraphFrame) == 0x000BA0, "Member 'AAthena_Prop_Living_Television_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_Living_Television_01_C, PointLight) == 0x000BA8, "Member 'AAthena_Prop_Living_Television_01_C::PointLight' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_Living_Television_01_C, AudioLoc) == 0x000BB0, "Member 'AAthena_Prop_Living_Television_01_C::AudioLoc' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_Living_Television_01_C, Spawn_Location) == 0x000BB8, "Member 'AAthena_Prop_Living_Television_01_C::Spawn_Location' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_Living_Television_01_C, bKillSound) == 0x000BC0, "Member 'AAthena_Prop_Living_Television_01_C::bKillSound' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_Living_Television_01_C, MID_Screen) == 0x000BC8, "Member 'AAthena_Prop_Living_Television_01_C::MID_Screen' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_Living_Television_01_C, StaticSound) == 0x000BD0, "Member 'AAthena_Prop_Living_Television_01_C::StaticSound' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_Living_Television_01_C, StaticLayerWarningSound) == 0x000BD8, "Member 'AAthena_Prop_Living_Television_01_C::StaticLayerWarningSound' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_Living_Television_01_C, StaticLayerCheckTime) == 0x000BE0, "Member 'AAthena_Prop_Living_Television_01_C::StaticLayerCheckTime' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_Living_Television_01_C, StaticLayerComp) == 0x000BE8, "Member 'AAthena_Prop_Living_Television_01_C::StaticLayerComp' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_Living_Television_01_C, StaticLayerMSound) == 0x000BF0, "Member 'AAthena_Prop_Living_Television_01_C::StaticLayerMSound' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_Living_Television_01_C, WarningLayerSpawnTime) == 0x000BF8, "Member 'AAthena_Prop_Living_Television_01_C::WarningLayerSpawnTime' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_Living_Television_01_C, WarningLayerComp) == 0x000C00, "Member 'AAthena_Prop_Living_Television_01_C::WarningLayerComp' has a wrong offset!");
static_assert(offsetof(AAthena_Prop_Living_Television_01_C, StaticComp) == 0x000C08, "Member 'AAthena_Prop_Living_Television_01_C::StaticComp' has a wrong offset!");

}

