#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Uncle_Dash_AttackTier2

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_Uncle_Dash_AttackTier2.GCN_Uncle_Dash_AttackTier2_C.OnBurst
// 0x01E8 (0x01E8 - 0x0000)
struct GCN_Uncle_Dash_AttackTier2_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FXScale;                                           // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C4E[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C4F[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0148(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_6C50[0x4];                                     // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Uncle_Dash_AttackTier2_C_OnBurst) == 0x000008, "Wrong alignment on GCN_Uncle_Dash_AttackTier2_C_OnBurst");
static_assert(sizeof(GCN_Uncle_Dash_AttackTier2_C_OnBurst) == 0x0001E8, "Wrong size on GCN_Uncle_Dash_AttackTier2_C_OnBurst");
static_assert(offsetof(GCN_Uncle_Dash_AttackTier2_C_OnBurst, MyTarget) == 0x000000, "Member 'GCN_Uncle_Dash_AttackTier2_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Uncle_Dash_AttackTier2_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_Uncle_Dash_AttackTier2_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Uncle_Dash_AttackTier2_C_OnBurst, ParticleComponents) == 0x0000C0, "Member 'GCN_Uncle_Dash_AttackTier2_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Uncle_Dash_AttackTier2_C_OnBurst, AudioComponents) == 0x0000D0, "Member 'GCN_Uncle_Dash_AttackTier2_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Uncle_Dash_AttackTier2_C_OnBurst, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCN_Uncle_Dash_AttackTier2_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Uncle_Dash_AttackTier2_C_OnBurst, BurstDecalInstance) == 0x0000E8, "Member 'GCN_Uncle_Dash_AttackTier2_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Uncle_Dash_AttackTier2_C_OnBurst, FXScale) == 0x0000F0, "Member 'GCN_Uncle_Dash_AttackTier2_C_OnBurst::FXScale' has a wrong offset!");
static_assert(offsetof(GCN_Uncle_Dash_AttackTier2_C_OnBurst, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'GCN_Uncle_Dash_AttackTier2_C_OnBurst::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_Uncle_Dash_AttackTier2_C_OnBurst, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000100, "Member 'GCN_Uncle_Dash_AttackTier2_C_OnBurst::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Uncle_Dash_AttackTier2_C_OnBurst, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000110, "Member 'GCN_Uncle_Dash_AttackTier2_C_OnBurst::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Uncle_Dash_AttackTier2_C_OnBurst, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000118, "Member 'GCN_Uncle_Dash_AttackTier2_C_OnBurst::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Uncle_Dash_AttackTier2_C_OnBurst, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000124, "Member 'GCN_Uncle_Dash_AttackTier2_C_OnBurst::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Uncle_Dash_AttackTier2_C_OnBurst, CallFunc_MakeVector_ReturnValue) == 0x000130, "Member 'GCN_Uncle_Dash_AttackTier2_C_OnBurst::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Uncle_Dash_AttackTier2_C_OnBurst, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x00013C, "Member 'GCN_Uncle_Dash_AttackTier2_C_OnBurst::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Uncle_Dash_AttackTier2_C_OnBurst, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000148, "Member 'GCN_Uncle_Dash_AttackTier2_C_OnBurst::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GCN_Uncle_Dash_AttackTier2_C_OnBurst, CallFunc_Conv_FloatToString_ReturnValue) == 0x0001D8, "Member 'GCN_Uncle_Dash_AttackTier2_C_OnBurst::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");

}

